import Author from "../models/Author";

const AUTHORS = [
  new Author(
    "a1",
    "سیروس شمیسا",
    "https://images.gr-assets.com/authors/1343241525p5/793829.jpg",
    "سیروس شَمیسا (زادهٔ ۲۹ فروردین ۱۳۲۷ در رشت) استاد ادبیّات فارسی و نویسندهٔ پرکار ایرانی است که تاکنون بیش از ۴۰ اثر خلق کرده‌ است. وی تحصیلات عالی خود را در دانشگاه شیراز آغاز کرد و چند سالی پزشکی خواند، ولی پس از چندی تغییر رشته داد و در همان‌جا مدرک کارشناسی خود را در ادبیّات فارسی گرفت. پس از آن وارد دورۀ دکتری ادبیات فارسی دانشگاه تهران شد و در سال ۱۳۵۷ از رساله خود به راهنمایی دکتر خانلری دفاع کرد. او در سال هشتاد یکی از چهره‌های ماندگار ایران لقب گرفت. کتاب‌های او در بسیاری از دانشگاههای ایران تدریس می شود."
  ),
  new Author(
    "a2",
    "غلامحسین ساعدی",
    "https://images.gr-assets.com/authors/1507074202p5/510737.jpg",
    `ساعدی در ۱۳ دی ۱۳۱۴ در تبریز متولد شد. دکتر علی اکبر ساعدی جراح برادر دکتر غلامحسین ساعدی نویسنده و شاعر شهیر و برجسته در باره برادرش و مدرسه طالقانی (منصور سابق) تبریز می‌گوید

    «غلامحسین ساعدی پس از پایان تحصیلات ابتدایی در دبستان بدر، کوچه غیاث در خرداد ماه سال ۱۳۲۷ گواهینامه ششم ابتدایی گرفت و در مهرماه همین سال برای ادامه تحصیل وارد دبیرستان منصور شد. دبیرستان منصور در زمینی بنا شده بود که قبلاً قبرستان بود، به هنگامی که منصور استاندار آذربایجان شده بود این دبیرستان سر و سامان گرفت و برای همین نام منصور را روی دبیرستان ما گذاشته بودند، دبیرستان خیلی خوبی بود، معروف بود، اتوریته داشت و خیلی هم از خانه ما دور نبود.»
    
    او کار خود را با روزنامه‌نگاری آغاز کرد. در نوجوانی به طور هم‌زمان در ۳ روزنامهٔ فریاد، صعود و جوانان آذربایجان مطلب می‌نوشت. اولین دستگیری و زندان او چند ماه پس از ۲۸ مرداد ۱۳۳۲ اتفاق افتاد. این دستگیری‌ها در زندگی او تا زمانی که در ایران بود، تکرار شد. وی تحصیلات خود را با درجه دکترای پزشکی، گرایش روان‌پزشکی در تهران به پایان رساند. مطبش در خیایان دلگشا در تهران قرار داشت و او بیشتر اوقات بدون گرفتن حق ویزیت بیماران را معاینه می‌کرد. ساعدی با چوب بدست‌های ورزیل، بهترین بابای دنیا، تک نگاری اهل هوا، پنج نمایشنامه از انقلاب تا مشروطیت، پرورابندان، دیکته و زاویه و آی بی کلاه، آی با کلاه، و چندین نمایشنامه دیگری که نوشت، وارد دنیای تئاتر ایران شد و نمایشنامه‌های او هنوز هم از بهترین نمایشنامه‌هایی هستند که از لحاظ ساختار و گفتگو به فارسی نوشته شده‌اند. او یکی از کسانی بود که به همراه بهرام بیضایی، رحیم خیاوی، بهمن فرسی، عباس جوانمرد، بیژن مفید، آربی اوانسیان، عباس نعلبندیان، اکبر رادی، اسماعیل خلج و... تئاتر ایران را در سال‌های ۴۰-۵۰ دگرگون کرد. پس از ۱۳۵۷ و درگیر شدن ساعدی با سانسور و دستگاه ضد فرهنگی در پس از انقلاب، نمایشنامه اتللو در سرزمین عجایب را که در خفقان و خفا به چاپ رساند و پس از دوران تعقیب و آزار نزدیکان وآشنایانش مجبور به فرار از ایران شد، وی در غربت به چاپ دوباره "الفبا" را (جهت حفظ فرهنگ) آغاز کرد. وی در روز شنبه ۲ آذر ۱۳۶۴ در پاریس درگذشت و در گورستان پرلاشز در کنار صادق هدایت به خاک سپرده‌ شد`
  ),
];

export default AUTHORS;
