import Book from "../models/Book";

const BOOKS = [
  new Book(
    "p1",
    "a1",
    "نگاهی تازه به بدیع",
    "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1237622364l/6348825.jpg",
    "سیروس شمیسا",
    "",
    245,
    "نشر میترا"
  ),
  new Book(
    "p2",
    "a1",
    "داستان یک روح: ش‍رح‌ و م‍ت‍ن‌ ک‍ام‍ل‌ ب‍وف‌ ک‍ور ص‍ادق‌ ه‍دای‍ت‌ ",
    "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1268629256l/2686413.jpg",
    "سیروس شمیسا",
    "دکتر سیروس شمیسا در کتاب «داستان یک روح» به نقد روانکاوانه داستان بوف کور اثر صادق هدایت می‌پردازد. او در این کتاب از نظریات روان شناختی کارل یونگ برای نقد اثر استفاده می‌کند.",
    350,
    "فردوس"
  ),
  new Book(
    "p3",
    "a1",
    "سبک شناسی شعر ",
    "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1537442711l/1727529.jpg",
    "سیروس شمیسا",
    "",
    432,
    "انتشارات فردوس"
  ),
  new Book(
    "p4",
    "a1",
    "نقد ادبی",
    "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1275126496l/8330781.jpg",
    "سیروس شمیسا",
    "",
    480,
    "نشر میترا"
  ),
  new Book(
    "p5",
    "a2",
    "عزاداران بیل",
    "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1323072574l/162084.jpg",
    "غلامحسین ساعدی",
    `عزاداران بَیَل مجموعه هشت داستان پیوسته درباره فلاکتهای مدام مردمان روستایی به نام بَیَل است. این کتاب را غلامحسین ساعدی نگاشته است و در سال ۱۳۴۳ چاپ شده است. این مجموعه از داستانهای روستایی غلامحسین ساعدی محسوب می‌شود. به نظر جمال میرصادقی دیگر نویسنده ایرانی و منتقد ادبی، منبع الهام ساعدی نقاب مرگ سرخ اثر ادگار آلن پو بوده است.
    از روی داستان چهارم این مجموعه فیلمنامه گاو نوشته و فیلم گاو ساخته شد.`,
    208,
    "نگاه"
  ),
];

export default BOOKS;
